{
  "welcome": "नमस्ते! मैं आपका कृषि सहायक हूँ। आज मैं आपकी कैसे मदद कर सकता हूँ?",
  "inputPlaceholder": "अपना सवाल पूछें...",
  "startRecording": "रिकॉर्डिंग शुरू करें",
  "stopRecording": "रिकॉर्डिंग बंद करें",
  "send": "संदेश भेजें",
  "Listen": "सुनें",
  "selectLanguage": "भाषा चुनें",
  "disclaimerText": "AI-उत्पन्न जानकारी। कृपया स्वतंत्र रूप से सत्यापित करें।",
  "questions": [
    "पीएम-किसान योजना क्या है और मैं इसके लिए कैसे आवेदन कर सकता हूं?",
    "मुझे किसान क्रेडिट कार्ड योजना के बारे में बताएं",
    "मैं प्रधानमंत्री फसल बीमा योजना के बारे में जानना चाहता हूं",
    "मृदा स्वास्थ्य कार्ड योजना के क्या लाभ हैं?",
    "क्या आप मुझे पीएमकेएसवाई योजना समझा सकते हैं?",
    "कृषि यंत्रीकरण पर उप-मिशन योजना क्या है?",
    "ई-नाम प्लेटफॉर्म कैसे काम करता है?",
    "किसानों के लिए कौन सी सरकारी योजनाएं उपलब्ध हैं?",
    "मुझे बीज प्रमाणीकरण योजना के बारे में जानकारी चाहिए",
    "कृषि अवसंरचना कोष के बारे में बताएं",
    "मैं अपनी पीएम-किसान भुगतान स्थिति कैसे जांच सकता हूं?",
    "मैं अपने फसल बीमा दावे की स्थिति जानना चाहता हूं",
    "क्या आप मेरी मृदा स्वास्थ्य कार्ड की स्थिति जांच सकते हैं?",
    "मेरी शिकायत की स्थिति क्या है जो मैंने पिछले महीने जमा की थी?",
    "क्या मेरा पीएमएफबीवाई दावा स्वीकृत हुआ है?",
    "मुझे अपनी पीएम-किसान किस्त नहीं मिली है, क्या आप जांच सकते हैं क्यों?",
    "मैं अपनी पीएम-किसान भुगतान न मिलने की शिकायत दर्ज करना चाहता हूं",
    "मैं अपने बीमा दावे के बारे में शिकायत कैसे दर्ज करूं?",
    "मेरा मृदा स्वास्थ्य कार्ड आवेदन महीनों से लंबित है, मैं शिकायत करना चाहता हूं",
    "मुझे योजना लाभ न मिलने के बारे में शिकायत दर्ज करनी है",
    "मेरा बीमा दावा स्वीकृत हुआ लेकिन मुझे मेरे बैंक खाते में पैसे नहीं मिले हैं",
    "मेरे पीएम-किसान भुगतान में देरी क्यों हो रही है?",
    "मुझे यूटीआर नंबर मिला लेकिन पैसा जमा नहीं हुआ, मुझे क्या करना चाहिए?",
    "मैं अपना मृदा स्वास्थ्य कार्ड ऑनलाइन कैसे जांच सकता हूं?",
    "मेरी मिट्टी परीक्षण रिपोर्ट का क्या मतलब है?",
    "मेरे मृदा स्वास्थ्य कार्ड के आधार पर मेरी मिट्टी के लिए कौन सी फसलें उपयुक्त हैं?",
    "क्या मुझे ऋण मिल सकता है यदि मेरी पिछली फसल विफल हो गई और मैं चुकौती नहीं कर सका?",
    "क्या ऋण में चूक करने से सरकारी योजनाओं के लिए मेरी पात्रता प्रभावित होगी?",
    "किसान क्रेडिट कार्ड के लिए आवेदन करने के लिए मुझे किन दस्तावेजों की आवश्यकता है?",
    "पंजाब में मेरी गेहूं की फसल के लिए मुझे कितना बीमा कवरेज मिलेगा?"
  ],
  "capabilities": [
    "उत्तर केवल मानक विश्वविद्यालय दस्तावेजों और फसल एसओपी पर आधारित हैं।",
    "आप फसल प्रथाओं, कीट/रोग नियंत्रण, उर्वरक कार्यक्रम और कटाई विधियों के बारे में पूछ सकते हैं।",
    "सिस्टम सामान्य कृषि सलाह दे सकता है लेकिन व्यक्तिगत प्रतिक्रिया नहीं।"
  ],
  "limitations": [
    "उत्तर प्रलेखित सर्वोत्तम प्रथाओं पर आधारित हैं—वास्तविक समय के मौसम, मिट्टी, या बाजार डेटा पर नहीं।",
    "क्षेत्र-विशिष्ट और खेत-विशिष्ट सिफारिशें इस समय उपलब्ध नहीं हैं।",
    "स्रोत संदर्भों के लिए ऐप में सूचीबद्ध आधिकारिक एसओपी दस्तावेजों का संदर्भ लें।"
  ],
  "feedbackOptions": [
    "जानकारी गलत है",
    "प्रतिक्रिया सहायक नहीं है",
    "जवाब मेरे प्रश्न से अप्रासंगिक है",
    "भाषा या लहज़ा अनुचित है",
    "अन्य मुद्दे"
  ],
  "feedbackTitle": "राय प्रदान करें",
  "feedbackDescription": "हमें यह देखते हैं कि प्रतिक्रिया उपयुक्त नहीं थी। कृपया हमें बताएं कि क्या गलत था ताकि हम अपने अपने बेहतर बना सकें।",
  "feedbackSubmit": "प्रतिक्रिया सबमिट करें",
  "feedbackCancel": "रद्द करें",
  "feedbackPlaceholder": "या हमें इस मुद्दे के बारे में और अधिक बताएं...",
  "appTitle": "भारत विस्तार - AI",
  "askYourQuestion": "आपका कृषि सहायक से पूछें",
  "sectionTitleAsk": "पूछें",
  "sectionTitleCapabilities": "क्षमताएँ", 
  "sectionTitleRemember": "याद रखें",
  "copyMessage": "संदेश कॉपी करें",
  "likeMessage": "संदेश पसंद करें",
  "dislikeMessage": "संदेश नहीं पसंद करें",
  "settings": "सेटिंग्ज",
  "theme": "थीम",
  "toast": { 
    "locationPermissionDenied": {
      "title": "स्थान अनुमति अस्वीकृत",
      "description": "स्थान पहुंच अस्वीकृत। मौसम संबंधित सुविधाएं उपलब्ध नहीं होंगी।"
    },
    "locationUnavailable": {
      "title": "स्थान अनुपलब्ध",
      "description": "स्थान पहुंच अनुपलब्ध। मौसम संबंधित सुविधाएं उपलब्ध नहीं होंगी।"
    },
    "locationTimeout": {
      "title": "स्थान टाइमआउट",
      "description": "आपका स्थान प्राप्त करने का अनुरोध समय समाप्त हो गया। कृपया पुनः प्रयास करें।"
    },
    "locationError": {
      "title": "स्थान त्रुटि",
      "description": "स्थान त्रुटि। मौसम संबंधित सुविधाएं उपलब्ध नहीं होंगी।"
    },
    "locationNotSupported": {
      "title": "स्थान समर्थित नहीं",
      "description": "आपका ब्राउज़र जियोलोकेशन का समर्थन नहीं करता है। मौसम संबंधित सुविधाएं उपलब्ध नहीं होंगी।"
    },
    "feedbackThankYou": {
      "title": "आपकी प्रतिक्रिया के लिए धन्यवाद! हमें खुशी है कि यह प्रतिसाद उपयोगी था।",
      "description": "हम अपने प्रतिसादों को बेहतर बनाने के लिए आपकी प्रतिक्रिया का उपयोग करेंगे।"
    },
    "feedbackSubmitted": {
      "title": "आपकी प्रतिक्रिया के लिए धन्यवाद। हम इसका उपयोग अपने प्रतिसादों को बेहतर बनाने के लिए करेंगे।",
      "description": "हम अपने प्रतिसादों को बेहतर बनाने के लिए आपकी प्रतिक्रिया का उपयोग करेंगे।"
    },
    "messageCopied": {
      "title": "संदेश कॉपी किया गया",
      "description": "संदेश आपके क्लिपबोर्ड पर कॉपी किया गया है"
    },
    "errorPlayingAudio": {
      "title": "ऑडियो चलाने में त्रुटि",
      "description": "ऑडियो चलाने में एक त्रुटि हुई थी। कृपया पुनः प्रयास करें।"
    },
    "apiError": {
      "description": "माफ़ कीजिए, आपके अनुरोध को संसाधित करने में त्रुटि हुई। कृपया पुनः प्रयास करें।"
    },
    "apiEmptyResponse": {
      "description": "माफ़ कीजिए, मैं इस समय आपके अनुरोध को संसाधित नहीं कर सका।"
    },
    "retrying": {
      "description": "सर्वर से कनेक्ट हो रहा है..."
    },
    "retryButton": "पुनः प्रयास करें",
    "appTitle": "भारत विस्तार"
  }
} 